[
  {
    "doi": "10.1007/s00205-016-1063-2",
    "type": "journal-article",
    "title": "Relative Energy for the Korteweg Theory and Related Hamiltonian Flows in Gas Dynamics",
    "authors": "Jan Giesselmann, Corrado Lattanzio, Athanasios E. Tzavaras",
    "abstract": "",
    "journal": "Archive for Rational Mechanics and Analysis",
    "year": "2017",
    "volume": "223",
    "issue": "3",
    "isbn": "",
    "pages": "1427--1484",
    "publisher": "Springer Science and Business Media LLC",
    "keywords": "",
    "dateY": "2016",
    "dateM": "11",
    "dateD": "18",
    "references": [{"doi":"10.1007/s00220-008-0632-0","title":"Antonelli P., Marcati P.: On the finite energy weak solutions to a system in quantum fluid dynamics. Commun. Math. Phys. 287, 657–686 (2009)"},{"doi":"10.1007/s00205-011-0454-7","title":"Antonelli P., Marcati P.: The quantum hydrodynamics system in two space dimensions. Arch. Ration. Mech. Anal. 203, 499–527 (2012)"},{"doi":"10.4171/IFB/130","title":"Benzoni-Gavage S., Danchin R., Descombes S., Jamet D.: Structure of Korteweg models and stability of diffuse interfaces. Interf. Free Bound. 7, 371–414 (2005)"},{"doi":"10.1512/iumj.2007.56.2974","title":"Benzoni-Gavage S., Danchin R., Descombes S.: On the well-posedness for the Euler–Korteweg model in several space dimensions. Indiana Univ. Math. J. 56, 1499–1579 (2007)"},{"doi":"","title":"Benzoni-Gavage, S.: Propagating phase boundaries and capillary fluids. Lecture Notes. 3ème cycle. Levico, 2010, pp. 57"},{"doi":"10.1007/BF01557084","title":"Brandon, D., Lin, T., Rogers, R.C.: Phase transitions and hysteresis in nonlocal and order-parameter models. Meccanica 30, 541–565 (1995). Microstructure and phase transitions in solids (Udine, 1994)"},{"doi":"10.1051/m2an/2012032","title":"Braack M., Prohl A.: Stable discretization of a diffuse interface model for liquid-vapor flows with surface tension. ESAIM: Math. Model. Numer. Anal. 47, 401–420 (2013)"},{"doi":"10.1016/j.na.2013.06.002","title":"Ballew J., Trivisa K.: Weakly dissipative solutions and weak-strong uniqueness for the Navier–Stokes–Smoluchowski system. Nonlinear Anal. 91, 1–19 (2013)"},{"doi":"10.1007/s00220-014-1967-3","title":"Brenier Y.: Topology-preserving diffusion of divergence-free vector fields and magnetic relaxation. Commun. Math. Phys. 330, 757–770 (2014)"},{"doi":"10.1016/j.jde.2013.12.017","title":"Charve F.: Local in time results for local and non-local capillary Navier–Stokes systems with large data. J. Differ. Equ. 256, 2152–2193 (2014)"},{"doi":"10.1007/BF00250353","title":"Dafermos C.M.: The second law of thermodynamics and stability. Arch. Ration. Mech. Anal. 70, 167–179 (1979)"},{"doi":"10.1080/01495737908962394","title":"Dafermos C.M.: Stability of motions of thermoelastic fluids. J. Thermal Stress. 2, 127–134 (1979)"},{"doi":"10.1007/BF00280911","title":"Dafermos C.M.: Quasilinear hyperbolic systems with involutions. Arch. Ration. Mech. Anal. 94, 373–389 (1986)"},{"doi":"10.1007/978-3-642-04048-1","title":"Dafermos, C.M.: Hyperbolic conservation laws in continuum physics, volume 325 of Grundlehren der Mathematischen Wissenschaften [Fundamental Principles of Mathematical Sciences], 3rd edn. Springer, Berlin (2010)"},{"doi":"10.1512/iumj.1979.28.28011","title":"DiPerna R.J.: Uniqueness of solutions to hyperbolic conservation laws. Indiana Univ. Math. J. 28, 137–188 (1979)"},{"doi":"10.1080/03605302.2014.972517","title":"Donatelli D., Feireisl E., Marcati P.: Well/ill posedness for the Euler–Korteweg–Poisson system and related problems. Commun. Partial Differ. Equ. 40, 1314–1335 (2015)"},{"doi":"10.1007/978-1-4612-1100-6","title":"Dubrovin, B.A., Fomenko, A.T., Novikov, S.P.: Modern Geometry-Methods and Applications. Part II. The Geometry and Topology of Manifolds. Graduate Texts in Mathematics, Vol. 104. Springer, New York 1985"},{"doi":"10.1007/BF00250907","title":"Dunn J.E., Serrin J.: On the thermomechanics of interstitial working. Arch. Ration. Mech. Anal. 88, 95–133 (1985)"},{"doi":"10.4171/PM/1937","title":"Engel P., Viorel A., Rohde C.: A low-order approximation for viscous-capillary phase transition dynamics. Port. Math. 70, 319–344 (2014)"},{"doi":"10.1007/s00205-011-0490-3","title":"Feireisl E., Novotný A.: Weak-strong uniqueness property for the full Navier–Stokes–Fourier system. Arch. Ration. Mech. Anal. 204, 683–706 (2012)"},{"doi":"","title":"Gelfand, I.M., Fomin, S.V.: Calculus of Variations, Prentice Hall, New York 1963"},{"doi":"10.1137/140951710","title":"Giesselmann J.: A relative entropy approach to convergence of a low order approximation to a nonlinear elasticity model with viscosity and capillarity. SIAM J. Math. Anal. 46, 3518–3539 (2014)"},{"doi":"10.1090/S0025-5718-2014-02792-0","title":"Giesselmann J., Makridakis C., Pryer T.: Energy consistent dg methods for the Navier–Stokes–Korteweg system. Math. Comput. 83, 2071–2099 (2014)"},{"doi":"10.1090/S0273-0979-1982-15004-2","title":"Hamilton R.S.: The inverse function theorem of Nash and Moser. Bull. AMS 7, 65–222 (1982)"},{"doi":"10.3934/cpaa.2010.9.1577","title":"Ju Q., Li H., Li Y., Jiang S.: Quasi-neutral limit of the two-fluid Euler–Poisson system. Commun. Pure Appl. Anal. 9, 1577–1590 (2010)"},{"doi":"10.1016/j.anihpc.2007.03.005","title":"Kotschote M.: Strong solutions for a compressible fluid model of Korteweg type. Ann. Inst. H. Poincaré Anal. Non Linéaire 25, 679–696 (2008)"},{"doi":"10.1007/s00205-005-0404-3","title":"Lattanzio C., Tzavaras A.E.: Structural properties of stress relaxation and convergence from viscoelasticity to polyconvex elastodynamics. Arch. Ration. Mech. Anal. 180, 449–492 (2006)"},{"doi":"10.1137/120891307","title":"Lattanzio C., Tzavaras A.E.: Relative entropy in diffusive relaxation. SIAM J. Math. Anal. 45, 1563–1584 (2013)"},{"doi":"10.1080/03605302.2016.1269808","title":"Lattanzio, C., Tzavaras, A.E.: From gas dynamics with large friction to gradient flows describing diffusion theories. (2016) (preprint)"},{"doi":"10.1007/s00205-011-0431-1","title":"Leger N., Vasseur A.: Relative entropy and the stability of shocks and contact discontinuities for systems of conservation laws with non-BV perturbations. Arch. Ration. Mech. Anal. 201, 271–302 (2011)"},{"doi":"10.1007/s00205-007-0108-y","title":"Luo T., Smoller J.: Existence and non-linear stability of rotating star solutions of the compressible Euler–Poisson equations. Arch. Ration. Mech. Anal. 191, 447–496 (2009)"},{"doi":"10.1007/978-0-387-21792-5","title":"Marsden, J.E., Ratiu, T.S.: Introduction to Mechanics and Symmetry, Texts in Applied Mathematics, Vol. 17, 2nd edn. Springer, New York 1999"},{"doi":"10.1002/fld.4065","title":"Neusser J., Rohde C., Schleper V.: Relaxation of the Navier–Stokes–Korteweg equations for compressible two-phase flow with phase transition. Int. J. Numer. Method. Fluid. 79, 615–639 (2015)"},{"doi":"10.1081/PDE-100002243","title":"Otto F.: The geometry of dissipative evolution equations: the porous medium equation. Commun. Partial Differ. Equ. 26, 101–174 (2001)"},{"doi":"","title":"Peng Y., Wang Y.: Convergence of compressible Euler–Poisson equations to incompressible type Euler equations. Asymp. Anal. 41, 141–160 (2005)"},{"doi":"10.1023/A:1011003321453","title":"Ren X., Truskinovsky L.: Finite scale microstructures in nonlocal elasticity. J. Elasticity 59, 319–355 (2000)"},{"doi":"10.1090/conm/526/10387","title":"Rohde, C.: A local and low-order Navier–Stokes–Korteweg system. In: Nonlinear partial differential equations and hyperbolic wave phenomena, vol. 526 of Contemp. Math., pp. 315–337. Am. Math. Soc. Providence, RI 2010"},{"doi":"10.4171/IFB/70","title":"Solci M., Vitali E.: Variational models for phase separation. Interf. Free Bound. 5, 27–46 (2003)"},{"doi":"","title":"Tian L., Xu Y., Kuerten J.G.M., Vander Vegt J.J.W.: A local discontinuous Galerkin method for the propagation of phase transition in solids and fluids. J. Sci. Comput. 9(3), 688–720 (2014)"}]
  }
,
  {
    "doi": "10.1109/IROS.2004.1389466",
    "type": "proceedings-article",
    "title": "Multi-variable port Hamiltonian model of piezoelectric material",
    "authors": "A. Macchelli, A.J. van der Schaft, C. Melchiorri",
    "abstract": "In this paper, the dynamics of a piezoelectric material is presented within the new framework of multi-variable distributed port Hamiltonian systems. This class of infinite dimensional system is quite general, thus allowing the description of several physical phenomena, such as heat conduction, elasticity, electromagnetism and, of course, piezoelectricity. The key point is the generalization of the notion of finite dimensional Dirac structure in order to deal with an infinite dimensional space of power variables. In this way, the dynamics of the system results from the interconnection of a proper set of elements, each of them characterized by a particular energetic behavior, while the interaction with the environment is described in terms of mechanical and electrical boundary ports.",
    "journal": "2004 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS) (IEEE Cat. No.04CH37566)",
    "year": "2005",
    "volume": "1",
    "issue": "",
    "isbn": "",
    "pages": "897--902",
    "publisher": "IEEE",
    "keywords": "",
    "dateY": "2005",
    "dateM": "4",
    "dateD": "1",
    "references": [{"doi":"","title":""},{"doi":"","title":""},{"doi":"","title":""},{"doi":"","title":""},{"doi":"10.2307/2001258","title":""},{"doi":"","title":""},{"doi":"","title":""},{"doi":"10.1016/S0393-0440(01)00083-3","title":""},{"doi":"","title":""},{"doi":"10.1007/978-1-4471-0507-7","title":""},{"doi":"","title":""},{"doi":"10.1137/S0363012996312039","title":""},{"doi":"","title":""},{"doi":"10.1109/CDC.2001.980911","title":""}]
  }
,
  {
    "doi": "10.1007/978-3-7643-8994-9",
    "type": "book",
    "title": "Observation and Control for Operator Semigroups",
    "authors": "Marius Tucsnak, George Weiss",
    "abstract": "",
    "journal": "null",
    "year": "2009",
    "volume": "",
    "issue": "",
    "isbn": "9783764389932",
    "pages": "",
    "publisher": "Birkhäuser Basel",
    "keywords": "",
    "dateY": "2009",
    "dateM": "6",
    "dateD": "9",
    "references": []
  }
]
